// ให้แสดงผลลัพธ์ดังนี้
// ===============
// รอบที่ 1 
// รอบที่ 2 
// รอบที่ 3 
// รอบที่ 4 
// รอบที่ 5 

package W12;

public class W12_01_exLoopFor {
    public static void main(String[] args) {
        
        // System.out.println("รอบที่ 1");
        // System.out.println("รอบที่ 2");
        // System.out.println("รอบที่ 3");
        // System.out.println("รอบที่ 4");
        // System.out.println("รอบที่ 5");
        
        
        // โครงสร้างคำสั่งลูป for แบ่งออกเป็น 3 ส่วน
        // 1. ส่วนตัวแปรเริ่มต้น
        // 2. เงื่อนไข
        // 3. การเพิ่มค่า / การลดค่า
        
    // TODO 1
        
        for(int i=1 ; i<=5 ; i++ ){
            // คำสั่งที่ต้องการทำซ้ำ
            System.out.println("รอบที่ "+i);
        }
        System.out.println("ToDo 1-for loop");
        for (int i = 1; i < 5; i++) {
            System.out.println("รอบที่" + i);
        }

        System.out.println ("__");

        System.out.println("ToDo 1-while loop");
        int n1 = 1;
        while (n1 < 5) {
        System.out.println("รอบที่" + n1);
           n1++;

           System.out.println ("__");   
        }

// ======================================================================

//คำสั่ง 1 ให้แสดงผลลัพธ์ดังนี้
// ===============
// รอบที่ 1 Hello World
// รอบที่ 2 Hello World
// รอบที่ 3 Hello World
// รอบที่ 4 Hello World
// รอบที่ 5 Hello World

// TODO2

        for(int i=1 ; i <=5 ; i++){
            // คำสั่งที่ต้องการทำซ้ำ
            System.out.println("รอบที่ "+ i +" Hello World ");
        }
        System.out.println("ToDo 2-for loop");
            for (int t1 = 1; t1 < 5; t1++) {
                System.out.println("รอบที่" + t1);
            }

        System.out.println("__");

           System.out.println("ToDo 2-while loop");
           int t1 = 1;
           while (t1 <= 5){
           System.out.println("รอบที่"+ t1 +"Hello World");
          t1++;

           System.out.println ("__");   
        }

    


// ======================================================================

//คำสั่ง 2 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 1 2 3 4 5 6 7 8 9 10

// TODO3



// ======================================================================


// TODO4
//คำสั่ง 2.1 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 1 2 3 4 5 6 7 8 9 10 = 55

   
// ======================================================================

// TODO5
//คำสั่ง 2.2 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 1+2+3+4+5+6+7+8+9+10 = 55






// ======================================================================


// TODO6
//คำสั่ง 3 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 10 9 8 7 6 5 4 3 2 1

    


// ======================================================================

// TODO7
//คำสั่ง 4 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 1 3 5 7 9 11 13 15 17 19
        System.out.println("ToDo 7-while loop");
  int total = 1;
  int coin = 0;
  while (coin<=9) { 
        System.out.print(total+" ");  
        total += 2;   
        coin++;
        
  } 

// ======================================================================

// TODO8
//คำสั่ง 5 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 2 4 6 8 10 12 14 16 18 20

int n8 =2;
int time = 20;
while (n8 <= time) {
    System.out.print(n8 + " ");
    n8 = n8 + 2;
}
       
    
        
    System.out.println("\n=======================================================================");

// ===============s=======================================================

// TODO9
//คำสั่ง 6 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 1 4 9 16 25 36 49 64 81 100


int n9 =2;
while (n9 <= 10) {
    System.out.print(n9*n9 + " ");
    n9++;
}
       
    
        
    System.out.println("\n=======================================================================");

        

// ======================================================================

//คำสั่ง 7 ให้แสดงผลลัพธ์ดังนี้
// ===============
// รอบที่ 1 เลขคี่
// รอบที่ 2 เลขคู่
// รอบที่ 3 เลขคี่
// รอบที่ 4 เลขคู่
// รอบที่ 5 เลขคี่

// TODO10
       

// ======================================================================
        }
    }