package W15;

public class W15_04_method_findMaxMin  {
    
    // 1) Method สำหรับหาค่ามากที่สุด


    // 2) Method สำหรับหาค่าน้อยที่สุด


    // 3) Method สำหรับหาค่ามากที่สุด โดยรับค่า 3 ตัว


    // 4) Method สำหรับหาค่าน้อยที่สุด โดยรับค่าเป็น array


    // 5) Method สำหรับแสดงค่าใน array ทั้งหมด




    public static void main(String[] args) {
        // 1) Method สำหรับหาค่ามากที่สุด
     

        // 2) Method สำหรับหาค่าน้อยที่สุด
        

        // 3) Method สำหรับหาค่ามากที่สุด โดยรับค่า 3 ตัว
        

        // 4) Method สำหรับหาค่าน้อยที่สุด โดยรับค่าเป็น array
       

        

    }
}

// method ที่มีชื่อเดียวกัน แต่มีพารามิเตอร์ต่างกันได้ เรียกว่า Method Overloading
// การเรียกใช้ method ที่มีชื่อเดียวกัน จะขึ้นอยู่กับพารามิเตอร์ที่ส่งเข้าไป
// ถ้ามี method ที่มีชื่อเดียวกัน และมีพารามิเตอร์ต่างกัน จะต้องมีการส่งพารามิเตอร์ตามที่ method ต้องการ